作业： 
阅读三篇文献：
ftp暂时没有；
斯坦福大学实现机器学习对于遥感影像对于制图的研究，与经济相关的贫困等基础设施的制图。
方法不是非常复杂，属于迁移学习，如何利用迁移学习解决问题。刊登关于遥感的相关工作，《国际遥感》。 
国际遥感其实是非常好的期刊。

1.联合高分遥感河机器学习来预测贫困，science上面几乎没有RS的文章。贫困对于经济发展等等都有关系。
science上面的research长文。 

GIS map 卷积网络——卷积
连续的卷积和离散的卷积 

2.计算机视觉 和 人工神经网络 卷积神经网络实现建筑物的提取，用航空影像实现建筑物的提取。 
自适应的实现了对于不同建筑的识别。 
算数平均矩阵和正态分布矩阵 

图像处理中的卷积，就是利用图像矩阵和模式矩阵来实现一个图像的平滑操作之类的。
看文献实现了对于研究方法的了解，同时实现了对于工作的意义的了解。  

写paper大多数都是废话
参考文献看的少，而且需要介绍一个别人做的工作和自己做的工作之间的差别。

latex软件的操作
继承是一个有用的C++特性。 也是面向对象的核心。

最核心的学习就是要学到一个比较好的思维方式，刚才的几篇文献都是非常简单的工作，但是人家的思维方式让你实现了science。

 
