#C++程序设计
// C++除了面向对象之外都是又C语言发展而来
//二级制的位运算+ 算数逻辑运算符+数据结构灵活+没有面向对象的思想
//汇编的学习需要学习计算机硬件
//可以用windows或者用unix进行操作 

//C++相对来说，平台的灵活性要差一些，而且有不同版本的C++
//C语言相对来说，更加的灵活，然后由于存在着标准库，因而。。。

//编译相对来说容易，但是运行很容易出错 
//编译就是用语法规则来检验程序，而运行是用+相对来说，更加额度灵活的语法


//对于数据类型的检查很弱，
//缺少支持代码重构的应用，大程序做不来


2017年9月8日13:47:23 
//cpp compile obj二进制文件 链接库文件 变成可执行文件.exe
//头文件起到了动态链接库的接口作用，头文件就是把通用变量函数的定义放在里面。

//源程序中要用到很多封装好的函数文件,通过库文件实现一个接口 ,形成目标文件
//iostream 文件的作用 ，输入输出的stream，起到了函数 ，保存在默认的路径下面。 
//C++自己并不带有一个输出的功能，因而需要的是用
//动态文件库，\n 


头文件中尽量是不要加上include ，然后可以在实际的应用中掉用include，但是该用还得用
#ifndef _Student_h_
#def _Stundent_h_
#endif 

然后就是尽量使用fgets和fputs
一般的用4bIT表示整数，也就是+-2的31次方 
常量和变量——保持不变的是常量  

//#define 所保存的文件的具体位置


//变量的命名叫做标识符——大小写不通用——变量名函数名和数组名 

malloc(float) 返回这个东西占用几个字节 

标识符常量的const或者#define 的编译宏

//C++的四舍五入 +0.5 然后取整数 
